app/Controllers/API/AuthController.php

    public function login()
    {
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {
            return $this->fail($this->validator->getErrors());
        }

        $user = $this->model->where('email', $this->request->getVar('email'))->first();

        if (!$user) {
            return $this->failNotFound('User not found.');
        }

        if (!password_verify($this->request->getVar('password'), $user['password'])) {
            return $this->failUnauthorized('Invalid credentials.');
        }

        // Get user role name
        $db = \Config\Database::connect();
        $role = $db->table('roles')->where('id', $user['role_id'])->get()->getRow()->name;
---
SELECT *
FROM `roles`
WHERE `id` = '3'