app/Controllers/API/InterviewController.php

    public function delete($id = null)
    {
        try {
            // Get user data from JWT token
            $userData = $this->_get_user_data();

            // Check if user is authorized (only admin or psychologist can delete)
            if (!in_array($userData->role, ['admin', 'psychologist'])) {
                return $this->failUnauthorized('No tienes permiso para eliminar entrevistas.');
            }

            // Validate interview ID
            if (empty($id)) {
                return $this->fail('Se requiere un ID de entrevista válido.');
            }

            $db = db_connect();
            $db->transStart();

            // Load models
            $interviewModel = new InterviewModel();
            $interviewAnswerModel = new InterviewAnswerModel();

            // Check if interview exists
            $interview = $interviewModel->find($id);
---
SELECT *
FROM `interviews`
WHERE `interviews`.`id` = '1'

            }

            // Delete all answers associated with this interview
            $interviewAnswerModel->where('interview_id', $id)->delete();

            // Delete the interview
            $deleted = $interviewModel->delete($id);
---
DELETE FROM `interview_answers`
WHERE `interview_id` = '1'
DELETE FROM `interviews`
WHERE `id` IN ('1')