app/Controllers/API/InterviewController.php

SELECT COUNT(*) AS `numrows`
FROM `interviews`
WHERE `patient_id` = '2'
---
        try {
            // Check if patient has already taken the interview
            $interviewModel = new \App\Models\InterviewModel();
            $hasInterview = $interviewModel->where('patient_id', $userData->userId)->countAllResults() > 0;

SELECT *
FROM `questions`
---
            if (empty($questions)) {
                // Try using model
                $questionModel = new \App\Models\QuestionModel();
                $questions = $questionModel->findAll();

INSERT INTO `interviews` (`patient_id`, `interview_date`) VALUES ('2', '2025-08-12 20:00:52')
---
                ];

                log_message('debug', '[' . $requestId . '] Inserting interview record: ' . json_encode($interviewData));
                $interviewId = $interviewModel->insert($interviewData);

INSERT INTO `interview_answers` (`interview_id`, `question_id`, `answer_text`) VALUES (2, 1, '{\"answer\":true,\"comments\":\"\"}')
---
                    log_message('debug', "[Answer $index] Attempting to insert: " . print_r($insertData, true));

                        // Try to insert the answer
                        $result = $interviewAnswerModel->insert($insertData);

SELECT `interviews`.`id`, `interviews`.`interview_date`, `users`.`name` as `patient_name`, `interviews`.`patient_id`
FROM `interviews`
JOIN `users` ON `users`.`id` = `interviews`.`patient_id`
WHERE `interviews`.`patient_id` = '2'
ORDER BY `interviews`.`interview_date` DESC
---
    public function index()
    {
        $userData = $this->_get_user_data();
        $interviewModel = new InterviewModel();
        $query = $interviewModel->select('interviews.id, interviews.interview_date, users.name as patient_name, interviews.patient_id')
            ->join('users', 'users.id = interviews.patient_id');

        // If user is a patient, only show their own interviews
        if ($userData->role === 'patient') {
            $query->where('interviews.patient_id', $userData->userId);
        }
        // Admin and psychologist can see all interviews
        elseif (!in_array($userData->role, ['admin', 'psychologist'])) {
            return $this->failUnauthorized('No tienes permiso para ver este recurso.');
        }

        $interviews = $query->orderBy('interviews.interview_date', 'DESC')
            ->findAll();

SELECT `interviews`.`id`, `interviews`.`interview_date`, `users`.`name` as `patient_name`, `users`.`email` as `patient_email`, `interviews`.`patient_id`
FROM `interviews`
JOIN `users` ON `users`.`id` = `interviews`.`patient_id`
WHERE `interviews`.`id` = '2'
AND `interviews`.`patient_id` = '2'
 LIMIT 1
SELECT `interview_answers`.`id`, `questions`.`question_text`, `interview_answers`.`answer_text`
FROM `interview_answers`
JOIN `questions` ON `questions`.`id` = `interview_answers`.`question_id`
WHERE `interview_answers`.`interview_id` = '24'
---
    public function show($id = null)
    {
        $userData = $this->_get_user_data();
        $interviewModel = new InterviewModel();

        // Build the base query
        $query = $interviewModel->select('interviews.id, interviews.interview_date, users.name as patient_name, users.email as patient_email, interviews.patient_id')
            ->join('users', 'users.id = interviews.patient_id')
            ->where('interviews.id', $id);

        // If user is a patient, only allow viewing their own interview
        if ($userData->role === 'patient') {
            $query->where('interviews.patient_id', $userData->userId);
        }
        // Admin and psychologist can see any interview
        elseif (!in_array($userData->role, ['admin', 'psychologist'])) {
            return $this->failUnauthorized('No tienes permiso para ver este recurso.');
        }

        // Forzar el resultado a ser un objeto para mantener la consistencia
        $interview = (object) $query->first();

        if (!$interview) {
            return $this->failNotFound('Entrevista no encontrada o no tienes permiso para verla.');
        }

        $interviewAnswerModel = new InterviewAnswerModel();
        $rawAnswers = $interviewAnswerModel
            ->select('interview_answers.id, questions.question_text, interview_answers.answer_text')
            ->join('questions', 'questions.id = interview_answers.question_id')
            ->where('interview_answers.interview_id', $id)
            ->findAll();

SELECT *
FROM `interviews`
WHERE `interviews`.`id` = '24'
---
    public function delete($id = null)
    {
        try {
            // Get user data from JWT token
            $userData = $this->_get_user_data();

            // Check if user is authorized (only admin or psychologist can delete)
            if (!in_array($userData->role, ['admin', 'psychologist'])) {
                return $this->failUnauthorized('No tienes permiso para eliminar entrevistas.');
            }

            // Validate interview ID
            if (empty($id)) {
                return $this->fail('Se requiere un ID de entrevista válido.');
            }

            $db = db_connect();
            $db->transStart();

            // Load models
            $interviewModel = new InterviewModel();
            $interviewAnswerModel = new InterviewAnswerModel();

            // Check if interview exists
            $interview = $interviewModel->find($id);

DELETE FROM `interview_answers`
WHERE `interview_id` = '24'
DELETE FROM `interviews`
WHERE `id` IN ('24')
---
            }

            // Delete all answers associated with this interview
            $interviewAnswerModel->where('interview_id', $id)->delete();

            // Delete the interview
            $deleted = $interviewModel->delete($id);