app/Controllers/API/UserController.php

SELECT `users`.`id`, `users`.`name`, `users`.`cedula`, `users`.`email`, `roles`.`name` as `role`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `roles`.`name` IN ('admin','psychologist')
ORDER BY `users`.`id` DESC
---
    public function index()
    {
        $users = $this->model
            ->select('users.id, users.name, users.cedula, users.email, roles.name as role')
            ->join('roles', 'roles.id = users.role_id')
            ->whereIn('roles.name', ['admin', 'psychologist'])
            ->orderBy('users.id', 'DESC')
            ->findAll();